export interface Question {
  id: number;
  text: string;
}

export const questions: Question[] = [
  { id: 1, text: "我喜欢在人群中处于中心地位。" },
  { id: 2, text: "我倾向于在做决定前深思熟虑。" },
  { id: 3, text: "我很容易信任他人。" },
  { id: 4, text: "我经常为未来制定详细的计划。" },
  { id: 5, text: "我喜欢尝试新的和不寻常的食物。" },
  { id: 6, text: "我经常感到焦虑或担忧。" },
  { id: 7, text: "我喜欢参加热闹的社交聚会。" },
  { id: 8, text: "我更喜欢按部就班的工作方式。" },
  { id: 9, text: "我对他人的痛苦感同身受。" },
  { id: 10, text: "我总是准时完成任务。" },
  { id: 11, text: "我喜欢抽象的思考和哲学讨论。" },
  { id: 12, text: "我很难控制自己的情绪。" },
  { id: 13, text: "我喜欢结识新朋友。" },
  { id: 14, text: "我倾向于保持环境的整洁有序。" },
  { id: 15, text: "我很少对他人的需求感到好奇。" },
  { id: 16, text: "我经常追求卓越和完美。" },
  { id: 17, text: "我喜欢去从未去过的地方旅行。" },
  { id: 18, text: "我很容易感到愤怒。" },
  { id: 19, text: "我喜欢与他人合作而非竞争。" },
  { id: 20, text: "我经常在行动前不考虑后果。" },
  { id: 21, text: "我富有想象力和创造力。" },
  { id: 22, text: "我经常感到情绪低落。" },
  { id: 23, text: "我喜欢分享我的观点和想法。" },
  { id: 24, text: "我更喜欢熟悉的环境和常规。" },
  { id: 25, text: "我倾向于宽恕那些伤害过我的人。" },
  { id: 26, text: "我经常感到精力充沛。" },
  { id: 27, text: "我喜欢分析复杂的问题。" },
  { id: 28, text: "我容易受到外界压力的影响。" },
  { id: 29, text: "我喜欢成为团队的领导者。" },
  { id: 30, text: "我倾向于把事情拖到最后一刻。" },
  { id: 31, text: "我喜欢欣赏艺术和自然之美。" },
  { id: 32, text: "我对自己充满信心。" }
];

export const options = [
  { label: "完全不同意", value: 1 },
  { label: "不同意", value: 2 },
  { label: "中立", value: 3 },
  { label: "同意", value: 4 },
  { label: "完全同意", value: 5 },
];